---
kind: property
id: P:Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldScaleY
source: html/2be9ef92-472b-bdcb-9ae6-a331e8196d48.htm
---
# Autodesk.Revit.DB.Visual.BumpMap.TextureRealWorldScaleY Property

The property labeled "Size Y" from the "BumpMap" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".